nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_adc_bms.c
/****************************************************************************
 * boards/arm/ra8/fpb-ra8e1/src/ra8e1_adc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/
 
#ifdef RA8E1_ADC_BMS_EXAMPLE

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <debug.h>
#include <errno.h>
#include <assert.h>

#include <nuttx/analog/adc.h>
#include <nuttx/arch.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "ra_gpio.h"
#include "board.h"
#include "ra8e1_log.h"


/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
 
/* ADC Channels *************************************************************/

/* Battery monitoring pins on FPB-RA8E1:
 * - P004 (AN000): Battery voltage through 5.7:1 voltage divider
 * - P003 (AN104): Battery current through ACS712-05B current sensor
 */

#define GPIO_ADC_BATT_VOLTAGE   (PORT_0 | PIN_4)
#define GPIO_ADC_BATT_CURRENT   (PORT_0 | PIN_3)

/* ADC Channel Numbers */

#define ADC_BATTERY_VOLTAGE_CHANNEL    0
#define ADC_BATTERY_CURRENT_CHANNEL    104

/* Board ADC Configuration **************************************************/

#define BOARD_ADC_VREF              3300
#define BOARD_ADC_RESOLUTION        4096

/* ADC Channel Definitions for FPB-RA8E1 */

#define ADC_BATTERY_VOLTAGE_CHANNEL   0   /* AN000 - P004 (Arduino A0) */
#define ADC_BATTERY_CURRENT_CHANNEL   104 /* AN104 - P003 (Arduino A1) */

/* Number of ADC channels used for battery monitoring */

#define BOARD_ADC_CHANNELS           2

/* Battery monitoring constants */

#define BATTERY_VOLTAGE_DIVIDER_RATIO  5.7f  /* 5.7:1 voltage divider */
#define CURRENT_SENSOR_SENSITIVITY    185   /* ACS712-05B: 185mV/A */
#define ADC_VREF_MV                   3300  /* 3.3V reference voltage */
#define ADC_RESOLUTION_BITS          12    /* 12-bit ADC */
#define ADC_MAX_VALUE                ((1 << ADC_RESOLUTION_BITS) - 1)

/* Battery voltage thresholds (in mV) */

#define BATTERY_VOLTAGE_MAX          4200  /* 4.2V fully charged */
#define BATTERY_VOLTAGE_MIN          3200  /* 3.2V discharged */

/* GPIO pin definitions for ADC channels */

#define GPIO_ADC_BATTERY_VOLTAGE     GPIO_P004_AN000  /* P004 as AN000 */
#define GPIO_ADC_BATTERY_CURRENT     GPIO_P003_AN104  /* P003 as AN104 */

/* DTC buffer size for batch ADC transfers */

#define ADC_DTC_BUFFER_SIZE          8

/****************************************************************************
 * Public Types
 ****************************************************************************/

/* Battery status structure for comprehensive monitoring */

struct battery_status_s
{
  uint32_t voltage_mv;          /* Battery voltage in millivolts */
  int32_t  current_ma;          /* Battery current in milliamps (+ = charging, - = discharging) */
  uint32_t power_mw;            /* Instantaneous power in milliwatts */
  uint8_t  percentage;          /* Battery percentage (0-100) */
  bool     is_charging;         /* True if battery is charging */
  bool     is_valid;            /* True if readings are valid */
};

/* ADC channel configuration structure */

struct adc_chan_s
{
  uint8_t  channel;             /* ADC channel number */
  uint32_t pinset;              /* GPIO pin configuration */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ADC device handle */

static FAR struct adc_dev_s *g_adc_dev = NULL;

/* ADC channel configuration for FPB-RA8E1 battery monitoring */

static const struct adc_chan_s g_adc_channels[BOARD_ADC_CHANNELS] =
{
  {
    .channel = ADC_BATTERY_VOLTAGE_CHANNEL,
    .pinset  = GPIO_ADC_BATTERY_VOLTAGE,
  },
  {
    .channel = ADC_BATTERY_CURRENT_CHANNEL,
    .pinset  = GPIO_ADC_BATTERY_CURRENT,
  },
};

/* Battery status cache */

static struct battery_status_s g_battery_status;
static bool g_adc_initialized = false;

/* DTC buffer for batch ADC operations */

#ifdef CONFIG_RA_ADC_DTC
static uint32_t g_adc_buffer[ADC_DTC_BUFFER_SIZE];
static uint8_t g_channel_buffer[ADC_DTC_BUFFER_SIZE];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra8e1_adc_setup
 *
 * Description:
 *   Setup ADC peripheral and GPIO pins for battery monitoring
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

static int ra8e1_adc_setup(void)
{
  int ret;
  uint32_t chanlist = 0;

  ainfo("Setting up ADC for battery monitoring\n");

  /* Configure GPIO pins for ADC channels */

