nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_adc_bms.c
int ra8e1_get_battery_status(struct battery_status_s *status)
{
  int ret;

  if (!g_adc_initialized)
    {
      aerr("ERROR: ADC not initialized\n");
      return -ENODEV;
    }

  if (status == NULL)
    {
      return -EINVAL;
    }

  /* Update battery data */

#ifdef CONFIG_RA_ADC_DTC
  ret = ra8e1_adc_read_battery_data_dtc();
#else
  ret = ra8e1_adc_read_battery_data();
#endif

  if (ret < 0)
    {
      return ret;
    }

  /* Copy status to output structure */

  memcpy(status, &g_battery_status, sizeof(struct battery_status_s));
  return OK;
}

/****************************************************************************
 * Name: ra8e1_adc_sample
 *
 * Description:
 *   Demonstration function showing ADC usage for battery monitoring
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure
 *
 ****************************************************************************/

int ra8e1_adc_sample(void)
{
  struct battery_status_s status;
  int ret;
  int sample_count = 10;

  printf("\n=== FPB-RA8E1 ADC Battery Monitoring Demo ===\n");

  /* Initialize ADC if not already done */

  if (!g_adc_initialized)
    {
      ra8e1_adc_initialize();
    }

  printf("Taking %d battery measurements...\n\n", sample_count);

  for (int i = 0; i < sample_count; i++)
    {
      ret = ra8e1_get_battery_status(&status);
      if (ret < 0)
        {
          printf("Sample %d: ERROR reading battery status (%d)\n", i + 1, ret);
          continue;
        }

      printf("Sample %d:\n", i + 1);
      printf("  Voltage:    %lu mV\n", status.voltage_mv);
      printf("  Current:    %ld mA %s\n", abs(status.current_ma),
             status.is_charging ? "(Charging)" : "(Discharging)");
      printf("  Power:      %lu mW\n", status.power_mw);
      printf("  Percentage: %d%%\n", status.percentage);
      printf("  Status:     %s\n\n", status.is_valid ? "Valid" : "Invalid");

      /* Wait between samples */

      usleep(500000);  /* 500ms delay */
    }

  printf("=== Demo Complete ===\n");
  return OK;
}

#endif /* CONFIG_RA_ADC */



#ifdef CONFIG_RA8E1_ADC_BMS_EXAMPLE
#include <arch/board/board.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define ADC_BATTERY_PROGNAME "adc_battery"
#define ADC_BATTERY_STACKSIZE 2048
#define ADC_BATTERY_PRIORITY 100

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: show_usage
 ****************************************************************************/

static void show_usage(FAR const char *progname, int exitcode)
{
  printf("USAGE: %s [OPTIONS]\n", progname);
  printf("\nWhere OPTIONS include:\n");
  printf("  -h      Show this help message and exit\n");
  printf("  -c <n>  Number of samples to take (default: 10)\n");
  printf("  -d <ms> Delay between samples in milliseconds (default: 1000)\n");
  printf("  -v      Verbose output\n");
  printf("  -s      Single sample mode\n");
  printf("  -m      Continuous monitoring mode\n");
  printf("\nExamples:\n");
  printf("  %s -c 5 -d 500    Take 5 samples with 500ms delay\n", progname);
  printf("  %s -s             Take a single sample\n", progname);
  printf("  %s -m             Continuous monitoring (Ctrl+C to stop)\n", progname);
  exit(exitcode);
}

/****************************************************************************
 * Name: print_battery_status
 ****************************************************************************/

#ifdef CONFIG_RA_ADC_BATTERY_MONITOR
static void print_battery_status(FAR struct battery_status_s *status, bool verbose)
{
  const char *charge_level = "Unknown";
  
  /* Determine charge level description */
  
  if (status->percentage >= 80)
    {
      charge_level = "High";
    }
  else if (status->percentage >= 50)
    {
      charge_level = "Medium";
    }
  else if (status->percentage >= 20)
    {
      charge_level = "Low";
    }
  else
    {
      charge_level = "Critical";
    }

  if (verbose)
    {
      printf("=== Battery Status ===\n");
      printf("Voltage:     %lu mV\n", status->voltage_mv);
      printf("Current:     %ld mA (%s)\n", 
             abs(status->current_ma),
             status->is_charging ? "Charging" : "Discharging");
      printf("Power:       %lu mW\n", status->power_mw);
      printf("Charge:      %d%% (%s)\n", status->percentage, charge_level);
      printf("Status:      %s\n", status->is_valid ? "Valid" : "Invalid");
      printf("Charging:    %s\n", status->is_charging ? "Yes" : "No");
      printf("======================\n");
    }
  else
    {
      printf("%lu mV | %ld mA | %lu mW | %d%% | %s\n",
             status->voltage_mv, status->current_ma, status->power_mw,
             status->percentage, status->is_charging ? "CHG" : "DIS");
    }
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra8e1_adc_bms_init
 *
 * Description:
 *   Initialize the ADC BMS demo
 *
 ****************************************************************************/

int ra8e1_adc_bms_init(void)
{
  /* Initialize ADC for battery monitoring */
  return battery_adc_initialize();
}

/****************************************************************************
 * Name: ra8e1_adc_bms_main
 *
 * Description:
 *   ADC Battery Monitoring Demo main function
 *
 ****************************************************************************/

int ra8e1_adc_bms_main(int argc, FAR char *argv[])
{
#ifdef CONFIG_RA_ADC_BATTERY_MONITOR
  struct battery_status_s status;
  int sample_count = 10;
  int delay_ms = 1000;
  bool verbose = false;
  bool single_mode = false;
  bool continuous_mode = false;
  int option;
  int ret;
  int i;

  /* Parse command line arguments */

  while ((option = getopt(argc, argv, "hc:d:vsm")) != ERROR)
    {
      switch (option)
        {
          case 'h':
            show_usage(argv[0], EXIT_SUCCESS);
            break;

